package com.zqc.mdoel.weather

class City(val cityName: String, val longitude: String, val latitude: String)

fun getCity(name: String): City {
    return city[name]!!
}

private val city = mapOf(
    "北京市" to City("北京市", "116.407526", "39.90403"),
    "上海市" to City("上海市", "121.473701", "31.230416"),
    "广州市" to City("广州市", "113.264434", "23.129162"),
    "深圳市" to City("深圳市", "114.057868", "22.543099"),
    "珠海市" to City("珠海市", "113.576726", "22.270715"),
    "佛山市" to City("佛山市", "113.121416", "23.021548"),
    "南京市" to City("南京市", "118.796877", "32.060255"),
    "苏州市" to City("苏州市", "120.585315", "31.298886"),
    "厦门市" to City("厦门市", "118.089425", "24.479833"),
    "南宁市" to City("南宁市", "108.366543", "22.817002"),
    "昆明市" to City("昆明市", "102.832891", "24.880095"),
    "成都市" to City("成都市", "104.066541", "30.572269"),
    "长沙市" to City("长沙市", "112.938814", "28.228209"),
    "福州市" to City("福州市", "119.296494", "26.074507"),
    "杭州市" to City("杭州市", "120.15507", "30.274084"),
    "武汉市" to City("武汉市", "114.305392", "30.593098"),
    "青岛市" to City("青岛市", "120.382639", "36.067082"),
    "西安市" to City("西安市", "108.940174", "34.341568"),
    "太原市" to City("太原市", "112.548879", "37.87059"),
    "石家庄市" to City("石家庄市", "114.514859", "38.042306"),
    "沈阳市" to City("沈阳市", "123.431474", "41.805698"),
    "重庆市" to City("重庆市", "106.551556", "29.563009"),
    "天津市" to City("天津市", "117.200983", "39.084158"),
)

val cityItemsList = listOf(
    "北京市", "上海市", "广州市", "深圳市", "珠海市", "佛山市",
    "南京市", "苏州市", "厦门市", "南宁市", "昆明市", "成都市", "长沙市", "福州市", "杭州市",
    "武汉市", "青岛市", "西安市", "太原市", "石家庄市", "沈阳市", "重庆市", "天津市"
)